users/profiles/doom/doom.d/README.org
***** Says
The format for normal channel or query talk.
+ nick - The nick talking.
+ body - The message.
#+begin_src elisp
(setq circe-format-say "<{nick}> {body}")
#+end_src

The format for messages to queries or channels.
+ nick - Your nick.
+ body - The body of the message.
#+begin_src elisp
(setq circe-format-self-say "<{nick}> {body}")
#+end_src

***** Messages
The format for normal channel or query talk.
+ nick - The nick talking.
+ body - The message.
#+begin_src elisp
(setq circe-format-message "<{nick}> → <{chattarget}>: {body}")
#+end_src

The format for messages sent to other people outside of queries.
+ chattarget - The target nick.
+ body - The body of the message.
#+begin_src elisp
(setq circe-format-self-message "<{nick}> → <{chattarget}>: {body}")
#+end_src

***** Actions
The format for actions in queries or channels.
+ nick - The nick doing the action.
+ body - The body of the action.
#+begin_src elisp
(setq circe-format-action "* <{nick}> {body}")
#+end_src

The format for actions to queries or channels.
+ nick - Your nick.
+ body - The body of the action.
#+begin_src elisp
(setq circe-format-self-action "* <{nick}> {body}")
#+end_src

The format for actions in messages outside of queries.
+ nick - The nick doing the action.
+ body - The body of the action.
#+begin_src elisp
(setq circe-format-message-action "* <{nick}> {body}")
#+end_src

***** Buffer Name
The format for buffer names.
+ target  - The target of the buffer.
+ network - The name of the network.
#+begin_src elisp
(setq circe-chat-buffer-name "{target}")
#+end_src

The format for the server buffer name.
+ network - The name of the network
+ host    - The host name of the server
+ port    - The port number or service name
+ service - Alias for port
#+begin_src elisp
(setq circe-server-buffer-name "{host}:{port}")
#+end_src

***** Notices
The format for a notice.
+ nick - The originator.
+ body - The notice.
#+begin_src elisp
(setq circe-format-notice "-{nick}- {body}")
#+end_src

The format for a server notice.
+ body - The notice.
#+begin_src elisp
(setq circe-format-server-notice "--SERVER-- {body}")
#+end_src

***** Topic
The format for topic changes.
+ nick       - The nick of the user who changed the topic
+ userhost   - The user@host string of that user
+ channel    - Where the topic change happened
+ new-topic  - The new topic
+ old-topic  - The previous topic
+ topic-diff - A colorized diff of the topics
#+begin_src elisp
(setq circe-format-server-topic "*** Topic change by {nick} ({userhost}): {old-topic} → {new-topic} | {topic-diff}")
#+end_src

***** Lurkers
The format for the first-activity notice of a user.
+ nick      - The originator.
+ jointime  - The join time of the user (in seconds).
+ joindelta - The duration from joining until now.
#+begin_src elisp
(setq circe-format-server-lurker-activity "*** First activity: {nick} joined {joindelta} ago ({jointime}).")
#+end_src

***** Joins
Format for join messages in a channel buffer.
+ nick         - The nick of the user joining
+ userhost     - The user@host string for the user
+ accountname  - The account name, if the server supports this
+ realname     - The real name, if the server supports this
+ userinfo     - A combination of userhost, accountname, and realname
+ channel      - The channel this user is joining
#+begin_src elisp
(setq circe-format-server-join "*** Join: {nick} ({userinfo})")
#+end_src

Format for join messages in query buffers of the joining user.
+ nick         - The nick of the user joining
+ userhost     - The user@host string for the user
+ accountname  - The account name, if the server supports this
+ realname     - The real name, if the server supports this
+ userinfo     - A combination of userhost, accountname, and realname
+ channel      - The channel this user is joining"
#+begin_src elisp
(setq circe-format-server-join-in-channel "*** Join: {nick} ({userinfo}) joined {channel}")
#+end_src

Format for mode changes.
+ setter       - The name of the split, usually describing the servers involved
+ userhost     - The user@host string for the user
+ target       - The target of this mode change
+ change       - The actual changed modes"
#+begin_src elisp
(setq circe-format-server-rejoin "*** Re-join: {nick} ({userinfo}), left {departuredelta} ago ({departuretime}).")
#+end_src

***** Whois Idle
Format for RPL_WHOISIDLE messages.
+ whois-nick      - The nick this is about
+ idle-seconds    - The number of seconds this nick has been idle
+ idle-duration   - A textual description of the duration of the idle time
+ signon-time     - The time (in seconds since the epoch) when this user signed on
+ signon-date     - A date string describing this time
+ signon-ago      - A textual description of the duraction since signon
#+begin_src elisp
(setq circe-format-server-whois-idle-with-signon "*** {whois-nick} is {idle-duration} idle (signon on {signon-date}, {signon-ago} ago)")
#+end_src

Format for RPL_WHOISIDLE messages.
+ whois-nick      - The nick this is about
+ idle-seconds    - The number of seconds this nick has been idle
+ idle-duration   - A textual description of the duration of the idle time
#+begin_src elisp
(setq circe-format-server-whois-idle "*** {whois-nick} is {idle-duration} idle")
#+end_src

***** Topic
Format for RPL_TOPICWHOTIME messages for the current channel.
+ channel         - The channel the topic is for
+ setter          - The nick of the person who set the topic
+ setter-userhost - The user@host string of the person who set the topic
+ topic-time      - The time the topic was set, in seconds since the epoch
+ topic-date      - A date string describing this time
+ topic-ago       - A textual description of the duration since the topic was set
#+begin_src elisp
(setq circe-format-server-topic-time "*** Topic set by {setter} on {topic-date}, {topic-ago} ago")
#+end_src

Format for RPL_TOPICWHOTIME messages for a channel we are not on.
+ channel         - The channel the topic is for
+ setter          - The nick of the person who set the topic
+ setter-userhost - The user@host string of the person who set the topic
+ topic-time      - The time the topic was set, in seconds since the epoch
+ topic-date      - A date string describing this time
+ topic-ago       - A textual description of the duration since the topic was set
#+begin_src elisp
(setq circe-format-server-topic-time-for-channel "*** Topic for {channel} set by {setter} on {topic-date}, {topic-ago} ago")
#+end_src

***** Channel Creation
Format for RPL_CREATIONTIME messages for the current channel.
+ channel  - The channel the topic is for
+ date     - A date string describing this time
+ ago      - A textual description of the duration since the channel was created
#+begin_src elisp
(setq circe-format-server-channel-creation-time "*** Channel {channel} created on {date}, {ago} ago")
#+end_src

***** CCTP
Format for CTCP requests.
+ nick      - The nick of the user who sent this PING request
+ userhost  - The user@host string of the user who sent this request
+ target    - The target of the message, usually us, but can be a channel
+ body      - The argument of the PING request, usually a number
+ ago       - A textual description of the duration since the request was sent, if parseable
#+begin_src elisp
(setq circe-format-server-ctcp "*** CTCP {command} request from {nick} ({userhost}) to {target}: {body}")
#+end_src

Format for CTCP PING requests.
+ nick      - The nick of the user who sent this PING request
+ userhost  - The user@host string of the user who sent this request
+ target    - The target of the message, usually us, but can be a channel
+ command   - The CTCP command used
+ body      - The argument of the PING request, usually a number
#+begin_src elisp
(setq circe-format-server-ctcp-ping "*** CTCP PING request from {nick} ({userhost}) to {target}: {body} ({ago} ago)")
#+end_src

Format for CTCP PING replies.
+ nick      - The nick of the user who sent this PING request
+ userhost  - The user@host string of the user who sent this request
+ target    - The target of the message, usually us, but can be a channel
+ body      - The argument of the PING request, usually a number
+ ago       - A textual description of the duration since the request was sent, if parseable
#+begin_src elisp
(setq circe-format-server-ctcp-ping-reply "*** CTCP PING reply from {nick} ({userhost}) to {target}: {ago} ago ({body})")
#+end_src

***** Net(split/merge)
Format for netsplit notifications.
+ split - The name of the split, usually describing the servers involved
#+begin_src elisp
(setq circe-format-server-netsplit "*** Netsplit: {split} (Use /WL to see who left)")
#+end_src

Format for netmerge notifications.
+ split   - The name of the split, usually describing the servers involved
+ time    - The time when this split happened, in seconds
+ date    - A date string describing this time
+ ago     - A textual description of the duration since the split happened
#+begin_src elisp
(setq circe-format-server-netmerge "*** Netmerge: {split}, split {ago} ago (Use /WL to see who's still missing)")
#+end_src

***** Server Mode Change
Format for mode changes.
+ setter       - The name of the split, usually describing the servers involved
+ userhost     - The user@host string for the user
+ target       - The target of this mode change
+ change       - The actual changed modes
#+begin_src elisp
(setq circe-format-server-mode-change "*** Mode change: {change} on {target} by {setter} ({userhost})")
#+end_src

***** Nickname Change
Format for nick changes of the current user.
+ old-nick - The old nick this change was from
+ new-nick - The new nick this change was to
+ userhost - The user@host string for the user
#+begin_src elisp
(setq circe-format-server-nick-change-self "*** Nick change: You are now known as {new-nick}")
#+end_src

Format for nick changes of other users.
+ old-nick - The old nick this change was from
+ new-nick - The new nick this change was to
+ userhost - The user@host string for the user
#+begin_src elisp
(setq circe-format-server-nick-change "*** Nick change: {old-nick} ({userhost}) is now known as {new-nick}")
#+end_src

Format nickname regains.
+ old-nick - The old nick this change was from
+ new-nick - The new nick this change was to
+ userhost - The user@host string for the user
#+begin_src elisp
(setq circe-format-server-nick-regain "*** Nick regain: {old-nick} ({userhost}) is now known as {new-nick}")
#+end_src

***** Server Quit // Channel Quit/Part
Format for users parting a channel.
+ nick     - The nick of the user who left
+ userhost - The user@host string for this user
+ channel  - The channel they left
+ reason   - The reason they gave for leaving
#+begin_src elisp
(setq circe-format-server-part "*** Part: {nick} ({userhost}) left {channel}: {reason}")
#+end_src

Format for users quitting from a channel.
+ nick     - The nick of the user who left
+ userhost - The user@host string for this user
+ channel  - The channel they left
+ reason   - The reason they gave for leaving
#+begin_src elisp
(setq circe-format-server-quit-channel "*** Quit: {nick} ({userhost}) left {channel}: {reason}")
#+end_src

Format for users quitting.
+ nick     - The nick of the user who left
+ userhost - The user@host string for this user
+ reason   - The reason they gave for leaving
#+begin_src elisp
(setq circe-format-server-quit "*** Quit: {nick} ({userhost}) left IRC: {reason}")
#+end_src

**** Timestamps in Margins
Emacs 23 added a feature called 'margins' which lets you have annotations in a margin area to the right or left of a buffer. Circe is able to put the timestamps in this area. Below is an example of how to do this. Note that in addition to telling Circe to use margins, you also need to tell emacs to turn on margins for your circe buffers.
#+begin_src elisp
(setq
 lui-time-stamp-position 'right-margin
 lui-time-stamp-format "%H:%M")

(add-hook 'lui-mode-hook 'my-circe-set-margin)
(defun my-circe-set-margin ()
  (setq right-margin-width 5))
#+end_src

