users/profiles/doom/doom.d/README.el

(setq circe-format-say "<{nick}> {body}")

(setq circe-format-self-say "<{nick}> {body}")

(setq circe-format-message "<{nick}> → <{chattarget}>: {body}")

(setq circe-format-self-message "<{nick}> → <{chattarget}>: {body}")

(setq circe-format-action "* <{nick}> {body}")

(setq circe-format-self-action "* <{nick}> {body}")

(setq circe-format-message-action "* <{nick}> {body}")

(setq circe-chat-buffer-name "{target}")

(setq circe-server-buffer-name "{host}:{port}")

(setq circe-format-notice "-{nick}- {body}")

(setq circe-format-server-notice "--SERVER-- {body}")

(setq circe-format-server-topic "*** Topic change by {nick} ({userhost}): {old-topic} → {new-topic} | {topic-diff}")

(setq circe-format-server-lurker-activity "*** First activity: {nick} joined {joindelta} ago ({jointime}).")

(setq circe-format-server-join "*** Join: {nick} ({userinfo})")

(setq circe-format-server-join-in-channel "*** Join: {nick} ({userinfo}) joined {channel}")

(setq circe-format-server-rejoin "*** Re-join: {nick} ({userinfo}), left {departuredelta} ago ({departuretime}).")

(setq circe-format-server-whois-idle-with-signon "*** {whois-nick} is {idle-duration} idle (signon on {signon-date}, {signon-ago} ago)")

(setq circe-format-server-whois-idle "*** {whois-nick} is {idle-duration} idle")

(setq circe-format-server-topic-time "*** Topic set by {setter} on {topic-date}, {topic-ago} ago")

(setq circe-format-server-topic-time-for-channel "*** Topic for {channel} set by {setter} on {topic-date}, {topic-ago} ago")

(setq circe-format-server-channel-creation-time "*** Channel {channel} created on {date}, {ago} ago")

(setq circe-format-server-ctcp "*** CTCP {command} request from {nick} ({userhost}) to {target}: {body}")

(setq circe-format-server-ctcp-ping "*** CTCP PING request from {nick} ({userhost}) to {target}: {body} ({ago} ago)")

(setq circe-format-server-ctcp-ping-reply "*** CTCP PING reply from {nick} ({userhost}) to {target}: {ago} ago ({body})")

(setq circe-format-server-netsplit "*** Netsplit: {split} (Use /WL to see who left)")

(setq circe-format-server-netmerge "*** Netmerge: {split}, split {ago} ago (Use /WL to see who's still missing)")

(setq circe-format-server-mode-change "*** Mode change: {change} on {target} by {setter} ({userhost})")

(setq circe-format-server-nick-change-self "*** Nick change: You are now known as {new-nick}")

(setq circe-format-server-nick-change "*** Nick change: {old-nick} ({userhost}) is now known as {new-nick}")

(setq circe-format-server-nick-regain "*** Nick regain: {old-nick} ({userhost}) is now known as {new-nick}")

(setq circe-format-server-part "*** Part: {nick} ({userhost}) left {channel}: {reason}")

(setq circe-format-server-quit-channel "*** Quit: {nick} ({userhost}) left {channel}: {reason}")

(setq circe-format-server-quit "*** Quit: {nick} ({userhost}) left IRC: {reason}")

(setq
 lui-time-stamp-position 'right-margin
 lui-time-stamp-format "%H:%M")

(add-hook 'lui-mode-hook 'my-circe-set-margin)
(defun my-circe-set-margin ()
  (setq right-margin-width 5))

(setq
 lui-time-stamp-position 'right-margin
