users/profiles/doom/doom.d/README.org
**** Fluid-Width Windows
Thanks to several interesting emacs features, Lui buffers can be made to dynamically fit arbitrary window sizes without turning ugly, even with right-aligned time-stamps. For this, put right-aligned time-stamps into the margin, preferably enable =fringes-outside-margins=, disable filling, enable word wrapping, and set =wrap-prefix= to a preferred value, e.g. the string you had in =lui-fill-type=. (The non-string values accepted in =lui-fill-type= are sadly not accepted here.)
#+begin_src elisp
(setq
 lui-time-stamp-position 'right-margin
 lui-fill-type nil)

(add-hook 'lui-mode-hook 'my-lui-setup)
(defun my-lui-setup ()
  (setq
   fringes-outside-margins t
   right-margin-width 5
   word-wrap t
   wrap-prefix "    "))
#+end_src
On a graphical display, emacs will display continuation indicators in the fringe by default when word-wrap is enabled. These can be disabled by adding the following form to the above my-lui-setup function.
#+begin_src elisp
(setf (cdr (assoc 'continuation fringe-indicator-alist)) nil)
#+end_src

** ox-json
#+begin_src elisp
(require 'ox-json)
#+end_src
** org-make-toc
~For tables of contents within orgmode so I dont have to look at md anymore~ This didnt work and was fairly bloaty, no clue what went wrong hopefully I can fix at some point
#+begin_src elisp
                                        ;(add-hook 'org-mode-hook #'org-make-toc-mode) ; automatically update toc
#+end_src
** org-ref
~org-ref is necessary for writing of any sort of academic material in emacs, makes citations a lot easier.~ I just use the built in =org-footnote-action=,  now, which I bind to =C-;=. Might go back to this at some point, maybe if I fix my LaTeX compiler.
#+begin_src elisp
(use-package! org-ref
    :after org
    :init
    ; code to run before loading org-ref
    :config
    ; code to run after loading org-ref
    )
(setq
      ;org-ref-notes-directory (concatenate 'string org-directory "/org-ref")
      org-ref-default-bibliography '("e:/Zotero/library.bib")
      org-ref-pdf-directory "e:/Zotero/pdfs")

(after! org
  (add-to-list 'org-capture-templates
               '(("a"               ; key
                  "Article"         ; name
                  entry             ; type
                  ;(file+headline (concatenate 'string org-directory "/foo.org) "Article")  ; target
                  "\* %^{Title} %(org-set-tags)  :article: \n:PROPERTIES:\n:Created: %U\n:Linked: %a\n:END:\n%i\nBrief description:\n%?"  ; template

                  :prepend t        ; properties
                  :empty-lines 1    ; properties
                  :created t        ; properties
))) )
#+end_src
** helm-bibtex
Helm BibTeX is a package that allows for searching through BibTeX bibliographies.
#+begin_src elisp
(use-package! helm-bibtex
  :after org
  :init
  ; blah blah
  :config
  ;blah blah
  )

(setq bibtex-format-citation-functions
      '((org-mode . (lambda (x) (insert (concat
                                         "\\cite{"
                                         (mapconcat 'identity x ",")
                                         "}")) ""))))
(setq
      bibtex-completion-pdf-field "file"
      bibtex-completion-bibliography
      '("e:/Zotero/library.bib")
      bibtex-completion-library-path '("e:/Zotero/")
     ; bibtex-completion-notes-path "~/Dropbox/Org/references/articles.org"  ;; not needed anymore as I take notes in org-roam
      )
#+end_src

* Open Buffers Upon Launch
I want to have my buffer list populated with oft-used files so that I dont have to open them by hand with dired every time.

/Note: the further down the file is opened the higher it will appear in the ibuffer menu./
** zulu-open-directory
#+begin_src elisp
(defun zulu-open-directory-looper (list dir)
  "A helper function for zulu-open-directory containing the loop logic"
  (while list
    (dired (concat dir "/" (car list)))
    (setq list (cdr list))))
(defun zulu-open-directory (dir)
"Opens all level-1 subfolders in (dir) as dired buffers."
(zulu-open-directory-looper (directory-files dir) dir))
#+end_src

#+RESULTS:
: zulu-open-directory

** IRC
See: [[Quick IRC Command]].
#+begin_src elisp
(irc)
#+end_src
** Documents
#+begin_src elisp
(zulu-open-directory "e:/emacs/documents/youtube-scripts/scripts")
(zulu-open-directory "e:/emacs/documents/notes/org")
(zulu-open-directory "e:/emacs/documents/agenda")
#+end_src
** Config Files
#+begin_src elisp
(find-file "~/.doom.d/README.org")
#+end_src
** Splash Screen
This is where I make my custom splash screen, I put it at the end so that it opens last. See [[https://github.com/hlissner/doom-emacs/issues/2204][this issue]], and [[https://github.com/tecosaur/emacs-config/blob/master/config.org#splash-screen][this repo]] ([[https://github.com/tecosaur/emacs-config/blob/46a5ffdc92728cb03e61987b9f4de04a87c4dc5d/config.org][this branch specifically]]) for my inspo.
*** Making The Splash Screen
#+begin_src elisp
(setq fancy-splash-image (expand-file-name "misc/splash-images/blackhole-lines.png" doom-private-dir))
#+end_src

*** Switching To It
#+begin_src elisp
(switch-to-buffer "*doom*")
#+end_src
