users/profiles/doom/doom.d/README.el
 lui-fill-type nil)

(add-hook 'lui-mode-hook 'my-lui-setup)
(defun my-lui-setup ()
  (setq
   fringes-outside-margins t
   right-margin-width 5
   word-wrap t
   wrap-prefix "    "))

(setf (cdr (assoc 'continuation fringe-indicator-alist)) nil)

(require 'ox-json)

                                        ;(add-hook 'org-mode-hook #'org-make-toc-mode) ; automatically update toc

(use-package! org-ref
    :after org
    :init
    ; code to run before loading org-ref
    :config
    ; code to run after loading org-ref
    )
(setq
      ;org-ref-notes-directory (concatenate 'string org-directory "/org-ref")
      org-ref-default-bibliography '("e:/Zotero/library.bib")
      org-ref-pdf-directory "e:/Zotero/pdfs")

(after! org
  (add-to-list 'org-capture-templates
               '(("a"               ; key
                  "Article"         ; name
                  entry             ; type
                  ;(file+headline (concatenate 'string org-directory "/foo.org) "Article")  ; target
                  "\* %^{Title} %(org-set-tags)  :article: \n:PROPERTIES:\n:Created: %U\n:Linked: %a\n:END:\n%i\nBrief description:\n%?"  ; template

                  :prepend t        ; properties
                  :empty-lines 1    ; properties
                  :created t        ; properties
))) )

(use-package! helm-bibtex
  :after org
  :init
  ; blah blah
  :config
  ;blah blah
  )

(setq bibtex-format-citation-functions
      '((org-mode . (lambda (x) (insert (concat
                                         "\\cite{"
                                         (mapconcat 'identity x ",")
                                         "}")) ""))))
(setq
      bibtex-completion-pdf-field "file"
      bibtex-completion-bibliography
      '("e:/Zotero/library.bib")
      bibtex-completion-library-path '("e:/Zotero/")
     ; bibtex-completion-notes-path "~/Dropbox/Org/references/articles.org"  ;; not needed anymore as I take notes in org-roam
      )

(defun zulu-open-directory-looper (list dir)
  "A helper function for zulu-open-directory containing the loop logic"
  (while list
    (dired (concat dir "/" (car list)))
    (setq list (cdr list))))
(defun zulu-open-directory (dir)
"Opens all level-1 subfolders in (dir) as dired buffers."
(zulu-open-directory-looper (directory-files dir) dir))

(irc)

(zulu-open-directory "e:/emacs/documents/youtube-scripts/scripts")
(zulu-open-directory "e:/emacs/documents/notes/org")
(zulu-open-directory "e:/emacs/documents/agenda")

(find-file "~/.doom.d/README.org")

(setq fancy-splash-image (expand-file-name "misc/splash-images/blackhole-lines.png" doom-private-dir))

(switch-to-buffer "*doom*")
